// მასივები ჯავასკრიპტში
// მასივები - რამოდენიმე მონაცემის გაერთიენებაა ერთ ცვლადში, განურჩევლად მონაცემთა ტიპისა
// var masivi = [1, "hello", 5, "wolrd" ];
// masivi.push = "john"

// document.write(masivi[4]);



// საკლასო დავალება 1 
var x = [12, 5, 43, 20, 23, 21, 67, 29, 26, 100]
var y = 0
while(y < x.length){
    document.write(x[y] + "<br>")
    y++
}
/*ეს კოდი x ცვლადის ელემენტებს გამოიტანს ეკრანზე/ 10 ელემენტი გვაქნს ცვლადში, 
კომპიუტერი იქამდე ამოიტანს ელემემტებს სანამ y ცვლადი არ გგაუტოლდება  \ცვადში არსებული ელემენტების რაოდენობას */

// მასივებში ელემენტები იწერება [ კვადრატულ ფრჩხილებში და გამიყოფა მძივით ერთმამნდეთისგან ]




// ოპერაციები მასივებში 

// ელემენტის დამატება
// masivi.push - მასივის ბოლოში ამატებს ელემენტს
var masivi = [1, 3, 545, "hello world", "masivi"]
// მასივში ელემენტის დამატებისას ის იწერება ჩვეულებრივ ფრჩხილებში და არა [ კვადრატულ ფრჩხილებში ]
masivi.push("i'm last element, i was added by using -push- operation")
document.write("<br>" + masivi)

// იგივენაირად მუშაობს unshift მეთოდი მაგრამ ის დასასწყისში ამატებს ელემენტს და არა ბოლოში, სინტაქსიც იგივენაირია
masivi.unshift("i'm first element, i was added by using -unshift- operation")
document.write("<br>" + masivi)


// ელემენტის წაშლა
// pop მეთოდი კი შლის ელემენტს მასივის ბოლოში
//სინტაქსი იგივეა რაც დამატებისას, მაგრამ ფრჩხილებში არაფერს ვწერთ
var masivi1 = [1, 343, 35, "hello world once more", 565, 23]
masivi1.pop()
document.write("<br>" + "<br>" + masivi1) 
// shift მეთოდი კი მასივის დასაწყისში შლის ელემენტს
// სინტაქსი იგივეა რაც pop მეთოდი
masivi1.shift()
document.write("<br>" + "<br>" + masivi1) 



// masivi.lenght რამდენი ელემენტისგან შედგება მასივი ვიგებთ .length მეთოდით
var masivi2 = [1, 56, 788, "hello world 3rd time", "blablabla"]
document.write("<br>" + "<br>" + masivi2.length)
// როგორც ჩანს ჩვემი მასივი შედგება 5 ელემენტისგან: 0, 1, 2, 3, 4.

// .charat ფუნქციით ვიგებთ შეუცავს თუ არ ჩვენი მასივი მითითებულ ელემენტს
// .charAt() - ფრჩხილებში გადაეცემა არგუმენტი, მასივი შეიცავს თუ არა მითითებულ ელემენტს და გამოაქვს true/false 
var g = masivi2.charAt(1)
document.write(g)


// 

